<template>
  <div class="blog-insta-wrap">
    <article class="blog-insta">
      <div class="blog-insta__header">
        <div class="blog-insta__title">
          <h2 class="visually-hidden">Жизнь Веб Альт</h2>
          <svg viewBox="0 0 282 27" xmlns="http://www.w3.org/2000/svg" fill-rule="evenodd" clip-rule="evenodd"
               stroke-linejoin="round" stroke-miterlimit="1.414">
            <path
                d="M.17 26l8.568-12.988L.51 1.35h5.44l7.922 11.696h.034V1.35h4.862v11.696h.034L26.724 1.35h5.338L23.97 13.046 32.538 26H27.03l-8.228-12.376h-.034V26h-4.862V13.624h-.034L5.61 26H.17zm35.153 0V1.35h4.59v17.952L51.507 1.35h4.59V26h-4.59V8.048L39.913 26h-4.59zm34.041.442c-1.541 0-2.901-.193-4.08-.578-1.156-.408-2.153-.975-2.992-1.7a8.349 8.349 0 01-1.938-2.652c-.476-1.02-.782-2.142-.918-3.366h4.658c.204 1.451.771 2.561 1.7 3.332.952.748 2.165 1.122 3.638 1.122 1.496 0 2.641-.34 3.434-1.02.816-.68 1.224-1.632 1.224-2.856 0-1.088-.396-1.927-1.19-2.516-.793-.612-1.938-.918-3.434-.918h-2.924v-3.944h2.652c1.247 0 2.267-.272 3.06-.816.816-.544 1.236-1.326 1.258-2.346-.022-1.156-.43-2.006-1.224-2.55-.77-.567-1.745-.85-2.924-.85a5.68 5.68 0 00-1.87.306 4.844 4.844 0 00-1.564.884c-.453.385-.827.85-1.122 1.394-.294.544-.453 1.167-.476 1.87h-4.658a9.595 9.595 0 01.918-3.332 8.367 8.367 0 012.074-2.618c.862-.748 1.882-1.326 3.06-1.734 1.202-.408 2.539-.612 4.012-.612 1.292 0 2.471.159 3.536.476 1.066.295 1.984.725 2.754 1.292a5.656 5.656 0 011.768 2.108c.431.816.646 1.745.646 2.788-.022 1.224-.34 2.278-.952 3.162-.612.861-1.462 1.575-2.55 2.142 1.224.408 2.21 1.077 2.958 2.006.748.929 1.122 2.233 1.122 3.91 0 1.337-.272 2.493-.816 3.468a6.637 6.637 0 01-2.142 2.346c-.884.612-1.915 1.065-3.094 1.36a14.517 14.517 0 01-3.604.442zM103.943 1.35V26h-4.862V15.358h-11.05V26h-4.862V1.35h4.862v10.064h11.05V1.35h4.862zM109.167 26V1.35h4.862v8.568h3.332c1.564 0 3.014.113 4.352.34 1.337.227 2.493.646 3.468 1.258a6.09 6.09 0 012.278 2.448c.544 1.043.816 2.38.816 4.012 0 1.609-.272 2.935-.816 3.978a6.334 6.334 0 01-2.278 2.482c-.975.589-2.131.997-3.468 1.224-1.338.227-2.788.34-4.352.34h-8.194zm4.862-3.944h3.502c.793 0 1.541-.045 2.244-.136.702-.113 1.314-.317 1.836-.612a3.432 3.432 0 001.224-1.258c.317-.521.476-1.213.476-2.074 0-.884-.159-1.587-.476-2.108a3.122 3.122 0 00-1.224-1.258c-.522-.295-1.134-.487-1.836-.578a14.142 14.142 0 00-2.244-.17h-3.502v8.194zm44.192-2.652l3.366-18.054h4.964L161.077 26h-5.746l-3.74-18.36-3.74 18.36h-5.746l-5.474-24.65h5.032l3.672 17.952 3.434-17.952h5.678l3.774 18.054zM168.757 1.35h17.952v3.944h-13.09v6.12h12.376v3.944h-12.376v6.698h13.09V26h-17.952V1.35zm20.984 0h9.588c1.088 0 2.165.102 3.23.306 1.066.181 2.018.521 2.856 1.02a5.575 5.575 0 012.074 1.972c.544.816.816 1.859.816 3.128 0 .589-.09 1.156-.272 1.7a6.488 6.488 0 01-.646 1.462 7.217 7.217 0 01-.918 1.224 5.05 5.05 0 01-.952.816c.476.227.93.499 1.36.816.454.295.85.669 1.19 1.122.34.453.612.997.816 1.632.204.612.306 1.337.306 2.176 0 1.337-.26 2.471-.782 3.4a6.435 6.435 0 01-2.04 2.244c-.861.567-1.87.986-3.026 1.258a16.756 16.756 0 01-3.604.374h-9.996V1.35zm4.862 20.842h5.372c1.428 0 2.494-.295 3.196-.884.703-.589 1.054-1.451 1.054-2.584 0-1.156-.362-2.029-1.088-2.618-.725-.612-1.847-.918-3.366-.918h-5.168v7.004zm0-10.676h5.032c1.156 0 2.052-.272 2.686-.816.658-.544.986-1.36.986-2.448 0-.975-.328-1.734-.986-2.278-.657-.544-1.552-.816-2.686-.816h-5.032v6.358zm16.968 7.446v-4.08h11.254v4.08h-11.254zM232.272 1.35h4.896L246.382 26h-5.27l-1.734-4.998h-9.588L228.056 26h-4.964l9.18-24.65zm-1.088 15.674h6.8l-3.4-9.724-3.4 9.724zm22.255 5.032h12.002V26h-16.864V1.35h4.862v20.706zm15.522-16.762h-7.582V1.35h20.06v3.944h-7.616V26h-4.862V5.294z"
                fill="none" stroke="#000" stroke-width=".42"/>
          </svg>
        </div>
        <span class="blog-insta__describe">Атмосфера, рабочие будни, путешествия, прямые включения и советы для вашего бизнеса тут:</span>
        <a href="https://www.instagram.com/web_alternative/" class="blog-insta__link" target="_blank"
           rel="noopener noreferrer"><i class="icon"></i>@web_alternative</a>
      </div>

      <list/>
    </article>
  </div>
</template>

<script>
import List from './List/List.vue';

export default {
  name: 'Instagram',
  components: { List },
};
</script>

<style scoped lang="scss">
@use "../../../../../styles/_config/index" as *;

$top-gap: vw(-145);
$top: 90px;
$top-pos: calc(#{$top} + #{$top-gap} * -1);

.blog-insta-wrap {
  //--top-gap: #{vw(-165)};

  grid-column: 8/13;
  transform: translateY($top-gap);
}

.blog-insta {
  //--top: 90px;

  position: sticky;
  top: $top-pos;

  margin-right: vw(-68);
  margin-bottom: 10vh;
  padding: 0 vw(100);
}

.blog-insta__header {
  margin-bottom: vw(20);
}

.blog-insta__title {
  margin-bottom: 5px;
}

.blog-insta__title svg {
  max-width: vw(282);
}

.blog-insta__describe {
  @include font-size($fz-text-sm);

  display: inline-block;
  margin-bottom: em(12, $fz-text-sm);

  color: var(--c-grey);
  font-weight: 600;
}

.blog-insta__link {
  @include font-size($fz-text-md);

  display: flex;
  align-items: center;
  color: inherit;
  text-decoration: none;
  transition: color var(--trans-dur-fast) ease-in;
}

.blog-insta__link .icon {
  @include font-size($fz-text-lg);
  @include bg-img("../../../../../images/i-instagram.svg");

  display: inline-block;
  width: 1em;
  height: 1em;
  margin-right: em(10, $fz-text-lg);

  transition: background-image var(--trans-dur-fast) ease-in;
}

.blog-insta__link:hover {
  color: var(--c-red);
}

.blog-insta__link:hover .icon {
  background-image: url("../../../../../images/i-instagram--orange.svg");
}
</style>